[
    {
        "title": "Holiday Food Analysis",
        "year": "2024",
        "image": "lib/holidayimage.png",
        "description": "Analyzed 100,000+ blog recipes, merging multiple datasets to identify similarities and differences between holiday and non-holiday foods in nutrition and consumption. Tested the effect of the holiday season on recipe ratings, hypothesizing that recipes submitted during holidays may be rated more favorably due to seasonal trends and sentiment. Built and improved the model by 40% via probabilistic imputation, log-transformation of skewed features, and hyperparameter tuning."
    },
    {
        "title": "San Francisco's June Gloom",
        "year": "2025",
        "image": "lib/project1dsc106.png",
        "description": "This visualization explores how San Francisco's famous summer fog impacts its sunshine trends compared to other major U.S. cities. Using a line chart, it highlights San Francisco's sharp dip in summer sunshine with a bold red line, a shaded blue region for June to August, and an annotation explaining 'June Gloom.' The design focuses on making the trend intuitive by de-emphasizing other cities while maintaining necessary context. This project effectively illustrates how San Francisco's summer climate sets it apart in a clear and engaging way."
    },
    {
        "title": "Healthcare Access and Quality",
        "year": "2024",
        "image": "lib/healthcareimage.png",
        "description": "This project investigates the variation in healthcare access and quality across different demographic groups in various U.S. cities over the past five years, focusing on geographical hospital density, facilities, funding, mortality rates, readmission rates, and patient satisfaction. By examining the interplay between income inequality and healthcare disparities, it aims to highlight systemic issues that contribute to unequal access to quality healthcare among different populations, particularly in the context of rising healthcare costs and socioeconomic factors."
    },
    {
        "title": "Profanity Checker Discord Bot",
        "year": "2022",
        "image": "lib/profanity.png",
        "description": "Collaborated with new teammates and learnt the basics of node.js and javascript to design and implement a working discord bot that kicks out users from a discord server who send messages in the chat that are deemed inappropriate. The bot incrementally scans incoming messages and kicks users after they type profanity. We also implemented a feature that exempted admin members from these rules and gave them the option to manually kick users with unique text commands."
    },
    {
        "title": "Space Invaders PyGame Clone",
        "year": "2021",
        "image": "lib/pygame.png",
        "description": "Worked with three teammates to design and implement a CutieHack(Citrus) themed Space Invaders Clone using python and Pygame. Implemented randomized smooth movement of all enemy objects, as well as hit detection, lives count display, boss health display, and special time events like an extra life power-up or boss special attack."
    },
    {
        "title": "Sit beatae nostrum atque.",
        "year": "",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Beatae iusto qui debitis voluptatem reprehenderit numquam temporibus est laudantium culpa. Ea dolorem, vel fuga impedit beatae placeat consectetur corporis pariatur mollitia provident aliquid molestiae tenetur quaerat dicta nobis voluptates."
    },
    {
        "title": "Error veritatis reprehenderit officiis?",
        "year": "",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Illum est dolore perspiciatis neque quod aut placeat quibusdam earum veniam id quae accusamus, laudantium alias esse quaerat ullam vero. Vero obcaecati ab id quam eius officia cum provident dignissimos?"
    },
    {
        "title": "Soluta harum recusandae dolor.",
        "year": "",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Accusamus veniam enim pariatur assumenda debitis sed, neque voluptate at asperiores quis velit modi fuga quo ipsa facere blanditiis similique temporibus illum repudiandae ipsum corporis necessitatibus vel. Dicta, porro aspernatur."
    },
    {
        "title": "Natus tempora id consequatur!",
        "year": "",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Aliquam, deleniti hic delectus pariatur, cum voluptas iusto reiciendis reprehenderit nam error ab sequi laborum quam tempora dolores atque aperiam possimus? Tenetur porro amet sed quia officiis molestiae impedit placeat!"
    },
    {
        "title": "Soluta libero at vitae?",
        "year": "",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Odio sed sunt asperiores nihil omnis ad nisi vero, quod explicabo odit quisquam, quas nostrum mollitia labore. Aperiam non corrupti aspernatur quas ipsum! Porro eveniet repellat delectus doloribus perspiciatis eius."
    },
    {
        "title": "Iure dolorum nihil culpa.",
        "year": "",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Id distinctio a vitae pariatur, iste recusandae earum odio adipisci numquam beatae vel itaque maxime! Distinctio corporis ipsam vero, hic nesciunt non dicta voluptates, natus reprehenderit, explicabo dignissimos in. Pariatur!"
    },
    {
        "title": "Ducimus voluptatem tempore quas.",
        "year": "",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Culpa dolor, impedit dolore consequuntur quo veniam esse vel nobis eveniet quas accusantium aperiam tempore, reprehenderit laudantium rerum quibusdam atque quaerat nisi, nam excepturi. Eligendi ipsam eaque perferendis provident rerum."
    }
]